autoconf
build-essential
clang-format
cmake
doxygen
emacs
eog
evince
g++
gcc
gdb
gfortran
git
grep
gzip
hdf5-tools
htop
kcachegrind
libblas-dev
libboost-all-dev
libeigen3-dev
liblapack-dev
libmotif-dev
libnetcdf-dev
libpmi0-dev
libxerces-c-dev
libxmu-dev
make
meld
ncdu
nfs-common
nmap
openjdk-21-jdk
openssh-server
p7zip-full
patchelf
python-is-python3
python3-pip
python3.12-venv
qtbase5-dev
texlive-base
texlive-latex-extra
texlive-science
tmux
unzip
valgrind
vim
zip
